package com.zj.wz.wbyx.wbyxAndroid.bean;

import android.support.annotation.Keep;

import java.util.List;

/**
 * FileName: ServiceBean
 * Author: 曹伟
 * Date: 2019/10/11 15:06
 * Description:服务条款
 */
@Keep
public class ServiceBean {

    /**
     * list : [{"title":"服务协议","content":"<p class=\"MsoNormal\">\r\n 本协议是用户（\u201c您\u201d）与上海责己网络科技有限公司(以下简称\u201c窝边优选\u201d)之间就您通过窝边优选软件使用窝边优选产品及服务等相关事宜所订立的契约。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 窝边优选软件包括窝边优选官网（www.wobianmall.com）、窝边优选APP、窝边优选公众号等（以下合称\u201c本站\u201d）。请您在使用窝边优选产品或者服务前仔细阅读本服务条款，特别是免除或限制您责任的条款以及争议解决条款等，在充分理解并同意后使用相关产品或者服务。如您不同意本协议或隐私政策中任何条款的约定，您应立即停止注册、使用窝边优选的软件和服务。一旦您开始使用窝边优选任何产品或者服务，即表示您已充分理解并同意本服务条款的全部内容，本服务条款即成为您与窝边优选间具有约束力的法律文件。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 请您注意，我们会不时地检查并更新服务条款，因此有关服务条款的内容会随之变化。我们请您定期查看服务条款页面，以确保您了解服务条款的最新版本。如果您在阅读完最新版服务条款后继续使用窝边优选任何产品或者服务，即视为您已充分理解并同意我们对服务条款的更新修改。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 本协议内容包括本协议正文以及所有窝边优选公开生效的适用于所有用户的各类服务条款及规则，该等服务条款与规则为本协议不可分割的组成部分，与本协议具有同等法律效力。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 一、用户注册\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 1.1您应当具备中华人民共和国法律规定的与您的行为相适应的民事行为能力。本站用户必须是具有完全民事行为能力的自然人,或者是依法设立并存续的实体组织。如您不具备前述的主体资格，请勿使用本站提供的产品和服务，否则因此导致的一切法律后果由您承担，且窝边优选有权立即停止与该用户的交易、注销该用户。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 1.2窝边优选用户应为以终端消费为目的的消费者，包括个人、国家机关、企业、事业单位及其他社会团体消费者，不包括以营利、销售等为目的的经销商。如发现用户为经销商的，窝边优选有权拒绝为其提供服务，并有权注销经销商注册的账户，由此产生的一切后果由经销商自行承担。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 1.3用户注册是指用户登录本站,按要求填写相关信息并确认同意履行相关服务条款的过程。您应确保提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新。如果您提供的注册资料不真实、不准确、不详尽、不合法的，您需要承担因此引起的相应责任及后果，窝边优选有权保留停止向您提供服务并注销您账户的权利。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 1.4您选择窝边优选支持的任一登录方式（包括手机验证码登录、微信登录）完成注册和登录，并同意和接受本协议所有条款，即成为窝边优选用户，本协议另有约定的遵照其约定。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 1.5您注册成功后，窝边优选为您开通一个账户，作为您在本站交易及使用窝边优选服务时的唯一身份标识，您应根据选择的登录方式妥善保管好您的登录名、密码、手机号、sim卡或微信账号，以免您的账户被盗用。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 1.6同一用户多次重复注册窝边优选账户会导致窝边优选系统对该用户身份的真实性、获取账户的合理动机等产生质疑。除非该用户对其试图重复获取账号的行为作出合理解释，否则为保护广大真实用户的真实消费需求与合法权益，窝边优选会拒绝或者直接注销您所有重复注册的账户，同时终止对这些重复注册账户提供服务。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 二、账户使用\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 2.1窝边优选账户与您的非现金支付工具是密切挂钩的，交由他人使用可能会造成您本人的支付工具端产生债权债务纠纷、资信问题等不良影响，因此窝边优选请您不要将自己的账户给予他人使用。从公平合理的角度出发，您应知晓所有通过账户实现的操作，窝边优选只能默认是您本人的行为，由此产生的后果由您自行独立承担。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 2.2如您发现账户存在被他人使用的情况，请立即通知窝边优选并可向公安机关报案，窝边优选在收到通知后合理时间内将采取措施最大限度防止损失扩大。窝边优选会立即同步排查造成您账户被他人使用的风险是否为窝边优选所致。请您理解窝边优选提供的服务是有限的，对于并非窝边优选责任所导致的账户风险与损失，窝边优选很难向您作出赔偿。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 2.3如您的账户存在违反法律法规、您与窝边优选之间的相关协议等行为时，将被窝边优选系统标识为异常账户。为保障绝大多数用户的合法权益，窝边优选有权拒绝为异常账户提供服务。除非您提供有效证据证明违法行为或者违反您与窝边优选之间相关协议的行为不成立的，窝边优选会终止为您提供任何服务并注销您的账户。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 2.4由于用户账户关联用户信息，仅当有法律明文规定、司法裁决或经窝边优选同意的情况下，您可进行账户的转让。您的账户一经转让，该账户项下权利义务一并转移。除此之外，您的账户不得以任何方式转让，否则窝边优选有权追究您的违约责任，且因此产生的一切责任均由您承担。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 二、窝边超级会员\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.1窝边超级会员：指签署本协议并根据窝边优选公布的收费标准支付相应费用后获取相应会员资格的用户以及申请超级会员免费体验服务且在超级会员试用期内的用户（以下简称\u201c超级会员\u201d）。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.2超级会员费用：除新用户注册送超级会员服务外，您申请开通超级会员服务时，需根据页面提示支付相应的会员服务费用后方可完成开通。基于权益调整、市场与业务的发展，窝边优选可能会调整超级会员服务开通所需会员服务费用。会员服务费用调整自公布之日起生效，您于调整前已开通的超级会员服务不受影响，但到期后若需续费开通，则需按照调整后已生效的费用标准支付。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.3超级会员权益：指用户基于其超级会员资格所享有的特殊权益，包括但不限于超级会员价。具体权益内容将通过本站\u201c超级会员页面\u201d进行不定期更新，请予以关注。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.4超级会员服务：为了改善用户体验、完善服务内容、保证超级会员与窝边优选提供服务的商业诉求一致，窝边优选会对超级会员及/或其相关服务、权益、功能、界面等进行更新、修改，包括开发新功能／权益、删除旧功能／权益等。用户可按照变更后超级会员的实际情况继续使用相应权益、功能或服务并适用本协议的相关约定。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.5超级会员使用规范\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.5.1申请开通超级会员服务时，用户同意并提交本人的真实信息，并保证提供的个人资料真实、准确、完整、合法有效，用户注册资料如有变动的应及时更新。如用户提供的资料不合法、不真实、不准确、不详尽，用户应承担由此引起的法律责任及损失，给窝边优选造成损失的，窝边优选保留向用户追偿的权利。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.5.2服务开通后，用户应谨慎合理的保存、使用其用户名和密码，并确保将合理使用超级会员服务，不利用超级会员服务进行盈利或非法获利，不以任何形式转让或转移用户所享有的超级会员服务或超级会员权益，不以任何方式将超级会员服务或超级会员权益借给他人使用。若窝边优选有合理理由怀疑用户存在任何不当使用会员服务行为的，窝边优选将取消用户的超级会员资格、作废超级会员权益且用户不应要求窝边优选退还用户所支付的会员服务费用。用户应对不当使用会员服务的行为及后果（包括损失）负责，若给窝边优选造成损失的，窝边优选有权向您追偿。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.5.3用户保证在获取和使用超级会员服务过程中应遵守诚实信用原则，若窝边优选合理怀疑用户存在以下任一情形的，用户将可能面临申请开通超级会员服务被拒绝、已开通的超级会员服务被终止或中止、已绑定或获取的超级会员权益被全部／部分取消或暂停使用，且用户不应要求退还已支付的会员服务费用（如有）：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）通过任何不正当手段或以违反诚实信用原则的方式开通超级会员服务的，如恶意绕过正常开通流程；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）同一用户注册、持有、使用或控制多个超级会员账号。其中，同一用户是指窝边优选账户注册信息、网络操作日志、交易订单信息等与用户身份和行为相关的信息，其中任意一项或数项存在相同、相似，亦或通过特定标记批量信息进行分析，其数项被认为存在相同、相似的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）用户在使用超级会员服务时，存在利用秒杀器等工具下单、套取优惠利差、虚假下单交易、提供虚假交易信息等扰乱交易秩序、违反交易规则的行为；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （4）经合理判断，会员使用超级会员权益获取的商品或服务并非个人生活所需，或非用于个人消费或使用的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （5）用户被认为存在违反超级会员服务中商品或服务提供方的相关协议或规则的行为，或已经被商品或服务提供方限制接受服务或购买商品的权利；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （6）其他违反诚实信用原则的行为。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.5.4您知悉并同意，为保证您充分享受超级会员服务、避免您错过优质会员权益，窝边优选可能通过消息、通知、短信等形式，向您提供会员权益相关信息。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.5.5窝边优选保留在法律法规允许的范围内自行决定接受或拒绝用户的超级会员开通申请、取消用户超级会员资格、调整超级会员服务内容、终止提供超级会员服务等相关权利。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.6超级会员服务终止\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.6.1您应理解超级会员服务具备一定有效期，自服务开通之日起计算，有效期届满后您未续费或重新开通的，超级会员服务终止，对应的超级会员权益失效。若您在有效期届满后希望继续享受超级会员服务的，则需续费或重新申请。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.6.2您应理解按本协议及相关规则使用超级会员服务、尊重使用限制以及按本协议约定履行义务是您使用超级会员服务的前提，如您违反本协议的相关约定，窝边优选会视您的实际违约情况选择中止、终止或解除本协议。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 3.6.3您知悉并确认，您所支付的会员服务费用代表您开通、使用超级会员服务窝边优选所付出的整体成本和努力，无法按照超级会员权益或有效期进行拆分。您在申请、开通或使用窝边优选超级会员服务时，若出现以下情形，将终止或中止对您的超级会员服务的，您不应要求退还部分或全部会员服务费用：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）您中途主动取消超级会员服务、放弃会员权益或终止资格的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）窝边优选根据《窝边优选服务条款》等协议及规则注销您的帐号、终止您的超级会员资格的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）若窝边优选无合理理由即自行决定终止向您提供超级会员服务且无法恢复的，作为对您曾为超级会员的回馈，窝边优选将根据您的会员权益实际持有及使用等情况给予合理补偿。因窝边优选认定您有违反本协议或任何相关法律的行为、欺诈或滥用超级会员的行为、或损害窝边优选利益或伤害其他用户的行为而导致的终止，窝边优选不予退款。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 四、商品交易\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 您在本站购买商品时必须遵守以下条款：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 4.1您在使用本站服务时应遵守所有适用的中国法律、法规、条例和地方性法律的要求。您还必须确保遵守本协议及纳入本协议的所有其他条款和规则的规定。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 4.2在您下订单时，请您仔细确认所购商品的名称、价格、数量、规格、包装、保质期等信息以及联系地址、电话、收货人等信息。收货人与您本人不一致时，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为和意思表示的法律后果承担连带责任。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 4.3出于水果生鲜食品仓储、运输的特殊性考虑，本站部分商品可能对销售区域作出限制，请您在下单时务必仔细查看商品详情页并准确填写收货地址，当收货地址超出配送范围时，窝边优选有权拒绝接受您的订单。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 4.4您理解并同意：当您作为消费者为生活消费需要下单并支付货款的情况下，您货款支付成功后即视为您与窝边优选之间就已支付货款部分的订单成立合同关系，该合同关系暂未生效。系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，窝边优选收到您的订单信息后，结合商品库存、交易的真实性与合理性、是否损害其他会员的利益等因素，判断是否与您就订单商品确认生效的合同关系。只有在窝边优选将您在订单中订购的商品从仓库实际直接向您发出时（以系统物流信息为准），方视为您与窝边优选之间就实际向您发出的商品建立的合同关系生效。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 4.5您理解并同意：尽管我们尽最大努力确保本站商品价格的准确性，本站商品目录中的一小部分商品可能偶尔会有定价错误。如果某一商品的正确定价应高于我们的网站错误价格，我们有权根据具体情况决定，在发货前联系您咨询您的意见按正确价格补齐差价，或者通知您后取消您的订单。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 4.6您理解并同意：本站有权在发现本站上显示的商品及订单明显错误或缺货的情况下,单方面撤回这些信息及取消订单。本站保留对商品订购数量的限制权。商品价格和可获性都将在本站上标明,显示的每一项价格都包含了增值税(按照法定税率)。送货费将另外结算,费用根据用户选择的送货方式的不同而异。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 五、配送\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 5.1窝边优选将会把商品配送至您所指定的送货地址。所有在本站上列出的送货时间均为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。参考时间不等同于到货时间，窝边优选不会就送达时间向您作出精准承诺，您理解由于受库存、同时段订单量及其他外部因素的影响，送货时间可能会早于或晚于参考时间。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 5.2为了保证配送及时准确、商品品质令人满意，您应当清楚准确地填写您的收货地址、联系人及联系方式等配送信息，您同意并授权窝边优选将您的配送信息粘贴在商品外包装上，您理解这是为向您提供物流配送服务而必须的动作，窝边优选提醒您收到商品后立即销毁外包装上的个人信息。您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 5.3如因以下情况造成订单延迟或无法配送等，本站将无法承担相关责任：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）您提供错误信息和不详细的地址；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）货物送达无人签收；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）不可抗力，例如：自然灾害、交通戒严、突发战争等。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 5.4配送费用以您提交订单时页面显示的运费为准。您理解，如您需要变更时间或地址进行重新配送的，可能需要承担额外产生的配送服务费用。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 六、用户的权利和义务\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 6.1您有权使用您的账户随时登录本站。您不得以任何形式转让或授权他人使用自己的账户,否则您应承担由此产生的全部责任,并与实际使用人承担连带责任。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 6.2您有权根据本协议的规定以及本站上发布的相关规则在本站上查询商品信息、发表使用体验、参与商品讨论、邀请关注好友、上传商品图片,参加本站的有关活动,以及享受本站提供的其它信息服务。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 6.3您应保证您提供的注册资料真实、准确、完整、合法有效,用户注册资料如有变动的,应及时更新其注册资料,在相关资料实际变更时及时更新有关注册资料。您保证不得以他人资料在本站进行注册和购买行为，如果您提供的注册资料不合法、不真实、不准确、不详尽的,您应承担因此引起的相应责任及后果。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 6.4您应当保证在使用本站购买商品过程中遵守诚实信用原则,不在购买过程中采取不正当行为,不扰乱网上交易的正常秩序。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 6.5您在使用窝边优选服务时，应遵守以下行为规范：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）从中国大陆向境外传输资料信息时必须符合中国有关法规；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （7）不得教唆他人从事本条所禁止的行为；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （8）不得利用在本站注册的账户进行牟利性经营活动；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （9）不得发布任何侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权利的内容。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 6.6您应对自己在本站的言论和行为承担法律责任，您若在本站上散布和传播反动、色情或其他违反国家法律的信息，本站的系统记录有可能作为您违反法律的证据。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 七、窝边优选的权利和义务\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 7.1对于您在本站交易平台上的不当行为或其它任何窝边优选认为应当终止服务的情况,本站有权随时作出删除相关信息、终止提供服务等处理而无须征得您的同意。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 7.2若您存在以下行为,窝边优选有权独立作出判断并采取注销或永久冻结您的账户,并保留诉诸法律的权利：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）使用虚假手机号码或其他虚假信息注册骗取新用户优惠活动的行为；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）使用新用户优惠活动购买的商品进行二次销售或代购的行为；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）未经本站同意,用户擅自在网站发布任何形式的广告；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （4）用户违反国家相关法律法规的规定或违反本协议其他约定的内容。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 7.3窝边优选有权通过邮件和短信的形式向您发送订单信息、促销活动等告知服务的权利，您注册并使用窝边优选的任何服务即视为您接受以上服务内容。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 八、信息收集、使用和隐私保护\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.1窝边优选尊重并保护您的隐私，您使用窝边优选服务，窝边优选将按照本条款来收集、使用您的个人信息；这里包含了窝边优选收集、存储、使用、共享和保护您个人信息的条款，窝边优选希望通过隐私权条款向您清晰地介绍窝边优选对您个人信息的处理方式，因此窝边优选建议您完整地阅读隐私权条款，以帮助您了解维护自己隐私权的方式。如果您不同意本隐私权政策中的任何内容，您应立即停止使用本软件及窝边优选服务，否则基于公平合理原则窝边优选只能认为您已同意本隐私权政策。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.2为更有效保障您的服务体验，窝边优选将收集您的如下信息：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.2.1您向窝边优选提供的信息\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）您在注册、登录和使用窝边优选服务过程中需要填写一些享受窝边优选服务所必须的信息，这可能包括您的真实姓名、收货地址、电子邮箱和联系电话等，否则您将无法顺利收到您所购买的商品。如果您不使用某些服务，则无需提供相关信息。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）为优化用户体验，您同意窝边优选记录您在使用本软件和窝边优选服务时提供的信息，例如您在本软件发布的公开评论、搜索关键词信息、与客服联系时您提供的相关信息等。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.2.2窝边优选会根据您授予的权限，接收并记录您所使用的移动设备的相关信息，这些信息包括：设备属性信息（如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备位置信息（如通过GPS、蓝牙或WIFI信号获得的位置信息）、设备连接信息等。这些信息只有您在设备中授予窝边优选相关权限后窝边优选才能获得。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.2.3来自第三方的信息。为预防欺诈和确保安全，您理解窝边优选的关联公司、合作伙伴向窝边优选分享您的信息。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.3窝边优选收集您的信息是为了向您提供窝边优选服务及提升服务质量，为了实现这一目的，窝边优选会把您的信息用于下列用途：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.3.1向您提供您使用的各项服务，并维护、改进这些服务；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.3.2向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息等。如您不希望接收上述信息，您可以自行选择或设置；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.3.3经您许可的其他用途。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.4您使用本软件及窝边优选服务可能存在您自行公开分享的信息，请注意您在本软件及窝边优选服务自愿共享的信息均有可能会涉及您或他人的个人信息甚至个人敏感信息，如您在评价时选择上传包含个人信息的图片、使用含您本人或家人照片的头像等。请您更加谨慎地考虑是否在上述公开渠道共享甚至公开分享相关信息。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.5窝边优选对您的非公开信息承担保密义务，不会出于第三方营销目的而向其出售或提供您的信息，除下列情形外我们不会与任何第三方共享您的信息：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.5.1事先获得授权；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.5.2向窝边优选的关联公司分享您的个人信息。我们只会共享您的必要个人信息，且受本隐私政策中所声明目的的约束；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.5.3出于遵守法律法规、诉讼或行政监管提出的行政司法要求，窝边优选可能有必要披露您的个人信息情形等。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 8.6窝边优选对于以上您隐私信息的使用、共享及保护将严格遵守《窝边优选隐私政策》。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 九、知识产权\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 窝边优选的相关标识和窝边优选服务所包含或提供的所有内容诸如文字、图标、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑、软件属于窝边优选及/或窝边优选的关联公司的知识产权，窝边优选服务中包含的或通过窝边优选服务提供的所有内容都是窝边优选独有的财产，受到中国和国际版权法律的保护。您不得复制、模仿、变形使用或发布上述标识，不得修改或删除应用产品中提现窝边优选及/或窝边优选关联公司的任何标识或身份信息，无权自行实施、利用、转让上述知识产权，无权用作任何商业推广。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 您应规范使用窝边优选的应用软件，不得从事下列行为：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）擅自对软件及/或其组成部分进行出租、出借、再许可、复制、修改、出版等活动，或借助软件发展衍生产品、作品、插件、外挂等；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）利用第三方的兼容软件或系统使用窝边优选的软件，或使用第三方的插件或外挂；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）删除窝边优选软件及副本上关于版权的信息、内容；或其他损害窝边优选版权的行为；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （4）对软件释放在终端中的任何数据进行截取、获取、复制、修改等；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （5）通过修改或伪造软件运行中的指令、数据、数据包，干扰软件的正常功能和运行；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （6）其他不当的使用行为。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 十、协议终止和违约责任\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 10.1您应理解并按照本协议的约定使用窝边优选提供的产品和服务，履行相应的义务，如您违反本协议的相关约定，窝边优选会视您的实际违约情况选择中止、终止或解除本协议。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 10.2您对软件的使用可能有赖于窝边优选关联公司为您提供的配套服务，如您违反与窝边优选关联公司的条款、协议、规则、通告等相关规定（如有）而被窝边优选关联公司中止或终止提供服务的，可能导致您无法正常使用本许可软件及窝边优选服务，窝边优选会视您的实际违约情况选择中止、终止或解除本协议。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 10.3您理解出于维护交易秩序及保护消费者权益的目的，如果您向窝边优选及/或窝边优选关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺并通知窝边优选依据您与其相关约定进行处理的，则窝边优选可按您的承诺或协议约定的方式对您作出限制，包括中止或终止对您提供窝边优选服务。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 10.4本协议的终止并不影响终止前您与窝边优选基于本协议产生的权利义务。因您的原因导致窝边优选遭受第三方索赔、行政部门处罚等，您应当赔偿窝边优选因此造成的损失及（或）发生的费用，包括合理的律师费用、调查取证费用等。如因您的个人行为造成窝边优选商誉损害的，窝边优选有权要求您在公开媒体上发表声明以消除影响。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 十一、免责条款\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 您理解窝边优选将严格按照法律规定以及本协议的约定，为您提供可靠、安全的产品及服务，但发生下列情形之一导致您遭受损失的，窝边优选无法承担责任：\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （1）由于您未妥善管理您的账号信息，或未妥善保管您的登录设备的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （2）发生设备维护、信息网络连接故障、智能终端、通讯或其他系统故障等情形的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （3）发生地震、海啸、台风、洪水、战争、武斗冲突、罢工、骚乱、暴动、行政机构或司法机构发布命令等不可抗力事件的；\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n （4）其他非因窝边优选原因造成的。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 十二、其他\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 12.1本协议将对您持续有效,有效期至您注销或者被取消账户、且停止切使用本站服务的行为后,但本站与您之间已经产生的权利义务,仍对双方有约束力。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 12.2窝边优选将视向您所提供服务内容之特性,要求您在注册本站提供的有关服务时,遵守特定的条件和条款，如该特定条件和条款与以上服务条款有任何不一致之处,则以特定条件和条款为准。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 12.3本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力,其余条款仍应有效并且有约束力。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 12.4本协议的标题、序号均为方便阅读而设定,不影响条款实际含义及其效力。本协议内容中以加粗方式显著标识的条款,请您着重阅读。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 12.5本协议自公布及适用的当天生效,有效期持续至更新版本发布之时。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 十三、适用的法律和管辖权\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 您和本站之间的契约将适用中华人民共和国的法律,所有的争端将诉诸于窝边优选所在地的人民法院。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n 如您对本协议有任何的疑问或建议，可随时致电我们的客服：025-52351126。\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>\r\n<p class=\"MsoNormal\">\r\n <br>\r\n<\/p>"}]
     * show : http://h5.wobianmall.com/?share=14552
     */

    private String show;
    private List<ListBean> list;

    public String getShow() {
        return show;
    }

    public void setShow(String show) {
        this.show = show;
    }

    public List<ListBean> getList() {
        return list;
    }

    public void setList(List<ListBean> list) {
        this.list = list;
    }

    public static class ListBean {
        /**
         * title : 服务协议
         * content : <p class="MsoNormal">
         本协议是用户（“您”）与上海责己网络科技有限公司(以下简称“窝边优选”)之间就您通过窝边优选软件使用窝边优选产品及服务等相关事宜所订立的契约。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         窝边优选软件包括窝边优选官网（www.wobianmall.com）、窝边优选APP、窝边优选公众号等（以下合称“本站”）。请您在使用窝边优选产品或者服务前仔细阅读本服务条款，特别是免除或限制您责任的条款以及争议解决条款等，在充分理解并同意后使用相关产品或者服务。如您不同意本协议或隐私政策中任何条款的约定，您应立即停止注册、使用窝边优选的软件和服务。一旦您开始使用窝边优选任何产品或者服务，即表示您已充分理解并同意本服务条款的全部内容，本服务条款即成为您与窝边优选间具有约束力的法律文件。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         请您注意，我们会不时地检查并更新服务条款，因此有关服务条款的内容会随之变化。我们请您定期查看服务条款页面，以确保您了解服务条款的最新版本。如果您在阅读完最新版服务条款后继续使用窝边优选任何产品或者服务，即视为您已充分理解并同意我们对服务条款的更新修改。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         本协议内容包括本协议正文以及所有窝边优选公开生效的适用于所有用户的各类服务条款及规则，该等服务条款与规则为本协议不可分割的组成部分，与本协议具有同等法律效力。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         一、用户注册
         </p>
         <p class="MsoNormal">
         1.1您应当具备中华人民共和国法律规定的与您的行为相适应的民事行为能力。本站用户必须是具有完全民事行为能力的自然人,或者是依法设立并存续的实体组织。如您不具备前述的主体资格，请勿使用本站提供的产品和服务，否则因此导致的一切法律后果由您承担，且窝边优选有权立即停止与该用户的交易、注销该用户。
         </p>
         <p class="MsoNormal">
         1.2窝边优选用户应为以终端消费为目的的消费者，包括个人、国家机关、企业、事业单位及其他社会团体消费者，不包括以营利、销售等为目的的经销商。如发现用户为经销商的，窝边优选有权拒绝为其提供服务，并有权注销经销商注册的账户，由此产生的一切后果由经销商自行承担。
         </p>
         <p class="MsoNormal">
         1.3用户注册是指用户登录本站,按要求填写相关信息并确认同意履行相关服务条款的过程。您应确保提供的注册资料真实、准确、完整、合法有效，注册资料如有变动的，应及时更新。如果您提供的注册资料不真实、不准确、不详尽、不合法的，您需要承担因此引起的相应责任及后果，窝边优选有权保留停止向您提供服务并注销您账户的权利。
         </p>
         <p class="MsoNormal">
         1.4您选择窝边优选支持的任一登录方式（包括手机验证码登录、微信登录）完成注册和登录，并同意和接受本协议所有条款，即成为窝边优选用户，本协议另有约定的遵照其约定。
         </p>
         <p class="MsoNormal">
         1.5您注册成功后，窝边优选为您开通一个账户，作为您在本站交易及使用窝边优选服务时的唯一身份标识，您应根据选择的登录方式妥善保管好您的登录名、密码、手机号、sim卡或微信账号，以免您的账户被盗用。
         </p>
         <p class="MsoNormal">
         1.6同一用户多次重复注册窝边优选账户会导致窝边优选系统对该用户身份的真实性、获取账户的合理动机等产生质疑。除非该用户对其试图重复获取账号的行为作出合理解释，否则为保护广大真实用户的真实消费需求与合法权益，窝边优选会拒绝或者直接注销您所有重复注册的账户，同时终止对这些重复注册账户提供服务。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         二、账户使用
         </p>
         <p class="MsoNormal">
         2.1窝边优选账户与您的非现金支付工具是密切挂钩的，交由他人使用可能会造成您本人的支付工具端产生债权债务纠纷、资信问题等不良影响，因此窝边优选请您不要将自己的账户给予他人使用。从公平合理的角度出发，您应知晓所有通过账户实现的操作，窝边优选只能默认是您本人的行为，由此产生的后果由您自行独立承担。
         </p>
         <p class="MsoNormal">
         2.2如您发现账户存在被他人使用的情况，请立即通知窝边优选并可向公安机关报案，窝边优选在收到通知后合理时间内将采取措施最大限度防止损失扩大。窝边优选会立即同步排查造成您账户被他人使用的风险是否为窝边优选所致。请您理解窝边优选提供的服务是有限的，对于并非窝边优选责任所导致的账户风险与损失，窝边优选很难向您作出赔偿。
         </p>
         <p class="MsoNormal">
         2.3如您的账户存在违反法律法规、您与窝边优选之间的相关协议等行为时，将被窝边优选系统标识为异常账户。为保障绝大多数用户的合法权益，窝边优选有权拒绝为异常账户提供服务。除非您提供有效证据证明违法行为或者违反您与窝边优选之间相关协议的行为不成立的，窝边优选会终止为您提供任何服务并注销您的账户。
         </p>
         <p class="MsoNormal">
         2.4由于用户账户关联用户信息，仅当有法律明文规定、司法裁决或经窝边优选同意的情况下，您可进行账户的转让。您的账户一经转让，该账户项下权利义务一并转移。除此之外，您的账户不得以任何方式转让，否则窝边优选有权追究您的违约责任，且因此产生的一切责任均由您承担。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         二、窝边超级会员
         </p>
         <p class="MsoNormal">
         3.1窝边超级会员：指签署本协议并根据窝边优选公布的收费标准支付相应费用后获取相应会员资格的用户以及申请超级会员免费体验服务且在超级会员试用期内的用户（以下简称“超级会员”）。
         </p>
         <p class="MsoNormal">
         3.2超级会员费用：除新用户注册送超级会员服务外，您申请开通超级会员服务时，需根据页面提示支付相应的会员服务费用后方可完成开通。基于权益调整、市场与业务的发展，窝边优选可能会调整超级会员服务开通所需会员服务费用。会员服务费用调整自公布之日起生效，您于调整前已开通的超级会员服务不受影响，但到期后若需续费开通，则需按照调整后已生效的费用标准支付。
         </p>
         <p class="MsoNormal">
         3.3超级会员权益：指用户基于其超级会员资格所享有的特殊权益，包括但不限于超级会员价。具体权益内容将通过本站“超级会员页面”进行不定期更新，请予以关注。
         </p>
         <p class="MsoNormal">
         3.4超级会员服务：为了改善用户体验、完善服务内容、保证超级会员与窝边优选提供服务的商业诉求一致，窝边优选会对超级会员及/或其相关服务、权益、功能、界面等进行更新、修改，包括开发新功能／权益、删除旧功能／权益等。用户可按照变更后超级会员的实际情况继续使用相应权益、功能或服务并适用本协议的相关约定。
         </p>
         <p class="MsoNormal">
         3.5超级会员使用规范
         </p>
         <p class="MsoNormal">
         3.5.1申请开通超级会员服务时，用户同意并提交本人的真实信息，并保证提供的个人资料真实、准确、完整、合法有效，用户注册资料如有变动的应及时更新。如用户提供的资料不合法、不真实、不准确、不详尽，用户应承担由此引起的法律责任及损失，给窝边优选造成损失的，窝边优选保留向用户追偿的权利。
         </p>
         <p class="MsoNormal">
         3.5.2服务开通后，用户应谨慎合理的保存、使用其用户名和密码，并确保将合理使用超级会员服务，不利用超级会员服务进行盈利或非法获利，不以任何形式转让或转移用户所享有的超级会员服务或超级会员权益，不以任何方式将超级会员服务或超级会员权益借给他人使用。若窝边优选有合理理由怀疑用户存在任何不当使用会员服务行为的，窝边优选将取消用户的超级会员资格、作废超级会员权益且用户不应要求窝边优选退还用户所支付的会员服务费用。用户应对不当使用会员服务的行为及后果（包括损失）负责，若给窝边优选造成损失的，窝边优选有权向您追偿。
         </p>
         <p class="MsoNormal">
         3.5.3用户保证在获取和使用超级会员服务过程中应遵守诚实信用原则，若窝边优选合理怀疑用户存在以下任一情形的，用户将可能面临申请开通超级会员服务被拒绝、已开通的超级会员服务被终止或中止、已绑定或获取的超级会员权益被全部／部分取消或暂停使用，且用户不应要求退还已支付的会员服务费用（如有）：
         </p>
         <p class="MsoNormal">
         （1）通过任何不正当手段或以违反诚实信用原则的方式开通超级会员服务的，如恶意绕过正常开通流程；
         </p>
         <p class="MsoNormal">
         （2）同一用户注册、持有、使用或控制多个超级会员账号。其中，同一用户是指窝边优选账户注册信息、网络操作日志、交易订单信息等与用户身份和行为相关的信息，其中任意一项或数项存在相同、相似，亦或通过特定标记批量信息进行分析，其数项被认为存在相同、相似的；
         </p>
         <p class="MsoNormal">
         （3）用户在使用超级会员服务时，存在利用秒杀器等工具下单、套取优惠利差、虚假下单交易、提供虚假交易信息等扰乱交易秩序、违反交易规则的行为；
         </p>
         <p class="MsoNormal">
         （4）经合理判断，会员使用超级会员权益获取的商品或服务并非个人生活所需，或非用于个人消费或使用的；
         </p>
         <p class="MsoNormal">
         （5）用户被认为存在违反超级会员服务中商品或服务提供方的相关协议或规则的行为，或已经被商品或服务提供方限制接受服务或购买商品的权利；
         </p>
         <p class="MsoNormal">
         （6）其他违反诚实信用原则的行为。
         </p>
         <p class="MsoNormal">
         3.5.4您知悉并同意，为保证您充分享受超级会员服务、避免您错过优质会员权益，窝边优选可能通过消息、通知、短信等形式，向您提供会员权益相关信息。
         </p>
         <p class="MsoNormal">
         3.5.5窝边优选保留在法律法规允许的范围内自行决定接受或拒绝用户的超级会员开通申请、取消用户超级会员资格、调整超级会员服务内容、终止提供超级会员服务等相关权利。
         </p>
         <p class="MsoNormal">
         3.6超级会员服务终止
         </p>
         <p class="MsoNormal">
         3.6.1您应理解超级会员服务具备一定有效期，自服务开通之日起计算，有效期届满后您未续费或重新开通的，超级会员服务终止，对应的超级会员权益失效。若您在有效期届满后希望继续享受超级会员服务的，则需续费或重新申请。
         </p>
         <p class="MsoNormal">
         3.6.2您应理解按本协议及相关规则使用超级会员服务、尊重使用限制以及按本协议约定履行义务是您使用超级会员服务的前提，如您违反本协议的相关约定，窝边优选会视您的实际违约情况选择中止、终止或解除本协议。
         </p>
         <p class="MsoNormal">
         3.6.3您知悉并确认，您所支付的会员服务费用代表您开通、使用超级会员服务窝边优选所付出的整体成本和努力，无法按照超级会员权益或有效期进行拆分。您在申请、开通或使用窝边优选超级会员服务时，若出现以下情形，将终止或中止对您的超级会员服务的，您不应要求退还部分或全部会员服务费用：
         </p>
         <p class="MsoNormal">
         （1）您中途主动取消超级会员服务、放弃会员权益或终止资格的；
         </p>
         <p class="MsoNormal">
         （2）窝边优选根据《窝边优选服务条款》等协议及规则注销您的帐号、终止您的超级会员资格的；
         </p>
         <p class="MsoNormal">
         （3）若窝边优选无合理理由即自行决定终止向您提供超级会员服务且无法恢复的，作为对您曾为超级会员的回馈，窝边优选将根据您的会员权益实际持有及使用等情况给予合理补偿。因窝边优选认定您有违反本协议或任何相关法律的行为、欺诈或滥用超级会员的行为、或损害窝边优选利益或伤害其他用户的行为而导致的终止，窝边优选不予退款。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         四、商品交易
         </p>
         <p class="MsoNormal">
         您在本站购买商品时必须遵守以下条款：
         </p>
         <p class="MsoNormal">
         4.1您在使用本站服务时应遵守所有适用的中国法律、法规、条例和地方性法律的要求。您还必须确保遵守本协议及纳入本协议的所有其他条款和规则的规定。
         </p>
         <p class="MsoNormal">
         4.2在您下订单时，请您仔细确认所购商品的名称、价格、数量、规格、包装、保质期等信息以及联系地址、电话、收货人等信息。收货人与您本人不一致时，收货人的行为和意思表示视为您的行为和意思表示，您应对收货人的行为和意思表示的法律后果承担连带责任。
         </p>
         <p class="MsoNormal">
         4.3出于水果生鲜食品仓储、运输的特殊性考虑，本站部分商品可能对销售区域作出限制，请您在下单时务必仔细查看商品详情页并准确填写收货地址，当收货地址超出配送范围时，窝边优选有权拒绝接受您的订单。
         </p>
         <p class="MsoNormal">
         4.4您理解并同意：当您作为消费者为生活消费需要下单并支付货款的情况下，您货款支付成功后即视为您与窝边优选之间就已支付货款部分的订单成立合同关系，该合同关系暂未生效。系统生成的订单信息是计算机信息系统根据您填写的内容自动生成的数据，窝边优选收到您的订单信息后，结合商品库存、交易的真实性与合理性、是否损害其他会员的利益等因素，判断是否与您就订单商品确认生效的合同关系。只有在窝边优选将您在订单中订购的商品从仓库实际直接向您发出时（以系统物流信息为准），方视为您与窝边优选之间就实际向您发出的商品建立的合同关系生效。
         </p>
         <p class="MsoNormal">
         4.5您理解并同意：尽管我们尽最大努力确保本站商品价格的准确性，本站商品目录中的一小部分商品可能偶尔会有定价错误。如果某一商品的正确定价应高于我们的网站错误价格，我们有权根据具体情况决定，在发货前联系您咨询您的意见按正确价格补齐差价，或者通知您后取消您的订单。
         </p>
         <p class="MsoNormal">
         4.6您理解并同意：本站有权在发现本站上显示的商品及订单明显错误或缺货的情况下,单方面撤回这些信息及取消订单。本站保留对商品订购数量的限制权。商品价格和可获性都将在本站上标明,显示的每一项价格都包含了增值税(按照法定税率)。送货费将另外结算,费用根据用户选择的送货方式的不同而异。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         五、配送
         </p>
         <p class="MsoNormal">
         5.1窝边优选将会把商品配送至您所指定的送货地址。所有在本站上列出的送货时间均为参考时间，参考时间的计算是根据库存状况、正常的处理过程和送货时间、送货地点的基础上估计得出的。参考时间不等同于到货时间，窝边优选不会就送达时间向您作出精准承诺，您理解由于受库存、同时段订单量及其他外部因素的影响，送货时间可能会早于或晚于参考时间。
         </p>
         <p class="MsoNormal">
         5.2为了保证配送及时准确、商品品质令人满意，您应当清楚准确地填写您的收货地址、联系人及联系方式等配送信息，您同意并授权窝边优选将您的配送信息粘贴在商品外包装上，您理解这是为向您提供物流配送服务而必须的动作，窝边优选提醒您收到商品后立即销毁外包装上的个人信息。您知悉并确认，您所购买的商品应仅由您填写的联系人接受身份查验后接收商品，因您变更联系人或相关配送信息而造成的损失由您自行承担。
         </p>
         <p class="MsoNormal">
         5.3如因以下情况造成订单延迟或无法配送等，本站将无法承担相关责任：
         </p>
         <p class="MsoNormal">
         （1）您提供错误信息和不详细的地址；
         </p>
         <p class="MsoNormal">
         （2）货物送达无人签收；
         </p>
         <p class="MsoNormal">
         （3）不可抗力，例如：自然灾害、交通戒严、突发战争等。
         </p>
         <p class="MsoNormal">
         5.4配送费用以您提交订单时页面显示的运费为准。您理解，如您需要变更时间或地址进行重新配送的，可能需要承担额外产生的配送服务费用。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         六、用户的权利和义务
         </p>
         <p class="MsoNormal">
         6.1您有权使用您的账户随时登录本站。您不得以任何形式转让或授权他人使用自己的账户,否则您应承担由此产生的全部责任,并与实际使用人承担连带责任。
         </p>
         <p class="MsoNormal">
         6.2您有权根据本协议的规定以及本站上发布的相关规则在本站上查询商品信息、发表使用体验、参与商品讨论、邀请关注好友、上传商品图片,参加本站的有关活动,以及享受本站提供的其它信息服务。
         </p>
         <p class="MsoNormal">
         6.3您应保证您提供的注册资料真实、准确、完整、合法有效,用户注册资料如有变动的,应及时更新其注册资料,在相关资料实际变更时及时更新有关注册资料。您保证不得以他人资料在本站进行注册和购买行为，如果您提供的注册资料不合法、不真实、不准确、不详尽的,您应承担因此引起的相应责任及后果。
         </p>
         <p class="MsoNormal">
         6.4您应当保证在使用本站购买商品过程中遵守诚实信用原则,不在购买过程中采取不正当行为,不扰乱网上交易的正常秩序。
         </p>
         <p class="MsoNormal">
         6.5您在使用窝边优选服务时，应遵守以下行为规范：
         </p>
         <p class="MsoNormal">
         （1）不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；
         </p>
         <p class="MsoNormal">
         （2）从中国大陆向境外传输资料信息时必须符合中国有关法规；
         </p>
         <p class="MsoNormal">
         （3）不得利用本站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；
         </p>
         <p class="MsoNormal">
         （4）不得干扰本站的正常运转，不得侵入本站及国家计算机信息系统；
         </p>
         <p class="MsoNormal">
         （5）不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；
         </p>
         <p class="MsoNormal">
         （6）不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；
         </p>
         <p class="MsoNormal">
         （7）不得教唆他人从事本条所禁止的行为；
         </p>
         <p class="MsoNormal">
         （8）不得利用在本站注册的账户进行牟利性经营活动；
         </p>
         <p class="MsoNormal">
         （9）不得发布任何侵犯他人隐私、个人信息、著作权、商标权等知识产权或合法权利的内容。
         </p>
         <p class="MsoNormal">
         6.6您应对自己在本站的言论和行为承担法律责任，您若在本站上散布和传播反动、色情或其他违反国家法律的信息，本站的系统记录有可能作为您违反法律的证据。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         七、窝边优选的权利和义务
         </p>
         <p class="MsoNormal">
         7.1对于您在本站交易平台上的不当行为或其它任何窝边优选认为应当终止服务的情况,本站有权随时作出删除相关信息、终止提供服务等处理而无须征得您的同意。
         </p>
         <p class="MsoNormal">
         7.2若您存在以下行为,窝边优选有权独立作出判断并采取注销或永久冻结您的账户,并保留诉诸法律的权利：
         </p>
         <p class="MsoNormal">
         （1）使用虚假手机号码或其他虚假信息注册骗取新用户优惠活动的行为；
         </p>
         <p class="MsoNormal">
         （2）使用新用户优惠活动购买的商品进行二次销售或代购的行为；
         </p>
         <p class="MsoNormal">
         （3）未经本站同意,用户擅自在网站发布任何形式的广告；
         </p>
         <p class="MsoNormal">
         （4）用户违反国家相关法律法规的规定或违反本协议其他约定的内容。
         </p>
         <p class="MsoNormal">
         7.3窝边优选有权通过邮件和短信的形式向您发送订单信息、促销活动等告知服务的权利，您注册并使用窝边优选的任何服务即视为您接受以上服务内容。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         八、信息收集、使用和隐私保护
         </p>
         <p class="MsoNormal">
         8.1窝边优选尊重并保护您的隐私，您使用窝边优选服务，窝边优选将按照本条款来收集、使用您的个人信息；这里包含了窝边优选收集、存储、使用、共享和保护您个人信息的条款，窝边优选希望通过隐私权条款向您清晰地介绍窝边优选对您个人信息的处理方式，因此窝边优选建议您完整地阅读隐私权条款，以帮助您了解维护自己隐私权的方式。如果您不同意本隐私权政策中的任何内容，您应立即停止使用本软件及窝边优选服务，否则基于公平合理原则窝边优选只能认为您已同意本隐私权政策。
         </p>
         <p class="MsoNormal">
         8.2为更有效保障您的服务体验，窝边优选将收集您的如下信息：
         </p>
         <p class="MsoNormal">
         8.2.1您向窝边优选提供的信息
         </p>
         <p class="MsoNormal">
         （1）您在注册、登录和使用窝边优选服务过程中需要填写一些享受窝边优选服务所必须的信息，这可能包括您的真实姓名、收货地址、电子邮箱和联系电话等，否则您将无法顺利收到您所购买的商品。如果您不使用某些服务，则无需提供相关信息。
         </p>
         <p class="MsoNormal">
         （2）为优化用户体验，您同意窝边优选记录您在使用本软件和窝边优选服务时提供的信息，例如您在本软件发布的公开评论、搜索关键词信息、与客服联系时您提供的相关信息等。
         </p>
         <p class="MsoNormal">
         8.2.2窝边优选会根据您授予的权限，接收并记录您所使用的移动设备的相关信息，这些信息包括：设备属性信息（如设备型号、操作系统版本、设备设置、唯一设备标识符等软硬件特征信息）、设备位置信息（如通过GPS、蓝牙或WIFI信号获得的位置信息）、设备连接信息等。这些信息只有您在设备中授予窝边优选相关权限后窝边优选才能获得。
         </p>
         <p class="MsoNormal">
         8.2.3来自第三方的信息。为预防欺诈和确保安全，您理解窝边优选的关联公司、合作伙伴向窝边优选分享您的信息。
         </p>
         <p class="MsoNormal">
         8.3窝边优选收集您的信息是为了向您提供窝边优选服务及提升服务质量，为了实现这一目的，窝边优选会把您的信息用于下列用途：
         </p>
         <p class="MsoNormal">
         8.3.1向您提供您使用的各项服务，并维护、改进这些服务；
         </p>
         <p class="MsoNormal">
         8.3.2向您推荐您可能感兴趣的内容，包括但不限于向您发出产品和服务信息等。如您不希望接收上述信息，您可以自行选择或设置；
         </p>
         <p class="MsoNormal">
         8.3.3经您许可的其他用途。
         </p>
         <p class="MsoNormal">
         8.4您使用本软件及窝边优选服务可能存在您自行公开分享的信息，请注意您在本软件及窝边优选服务自愿共享的信息均有可能会涉及您或他人的个人信息甚至个人敏感信息，如您在评价时选择上传包含个人信息的图片、使用含您本人或家人照片的头像等。请您更加谨慎地考虑是否在上述公开渠道共享甚至公开分享相关信息。
         </p>
         <p class="MsoNormal">
         8.5窝边优选对您的非公开信息承担保密义务，不会出于第三方营销目的而向其出售或提供您的信息，除下列情形外我们不会与任何第三方共享您的信息：
         </p>
         <p class="MsoNormal">
         8.5.1事先获得授权；
         </p>
         <p class="MsoNormal">
         8.5.2向窝边优选的关联公司分享您的个人信息。我们只会共享您的必要个人信息，且受本隐私政策中所声明目的的约束；
         </p>
         <p class="MsoNormal">
         8.5.3出于遵守法律法规、诉讼或行政监管提出的行政司法要求，窝边优选可能有必要披露您的个人信息情形等。
         </p>
         <p class="MsoNormal">
         8.6窝边优选对于以上您隐私信息的使用、共享及保护将严格遵守《窝边优选隐私政策》。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         九、知识产权
         </p>
         <p class="MsoNormal">
         窝边优选的相关标识和窝边优选服务所包含或提供的所有内容诸如文字、图标、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑、软件属于窝边优选及/或窝边优选的关联公司的知识产权，窝边优选服务中包含的或通过窝边优选服务提供的所有内容都是窝边优选独有的财产，受到中国和国际版权法律的保护。您不得复制、模仿、变形使用或发布上述标识，不得修改或删除应用产品中提现窝边优选及/或窝边优选关联公司的任何标识或身份信息，无权自行实施、利用、转让上述知识产权，无权用作任何商业推广。
         </p>
         <p class="MsoNormal">
         您应规范使用窝边优选的应用软件，不得从事下列行为：
         </p>
         <p class="MsoNormal">
         （1）擅自对软件及/或其组成部分进行出租、出借、再许可、复制、修改、出版等活动，或借助软件发展衍生产品、作品、插件、外挂等；
         </p>
         <p class="MsoNormal">
         （2）利用第三方的兼容软件或系统使用窝边优选的软件，或使用第三方的插件或外挂；
         </p>
         <p class="MsoNormal">
         （3）删除窝边优选软件及副本上关于版权的信息、内容；或其他损害窝边优选版权的行为；
         </p>
         <p class="MsoNormal">
         （4）对软件释放在终端中的任何数据进行截取、获取、复制、修改等；
         </p>
         <p class="MsoNormal">
         （5）通过修改或伪造软件运行中的指令、数据、数据包，干扰软件的正常功能和运行；
         </p>
         <p class="MsoNormal">
         （6）其他不当的使用行为。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         十、协议终止和违约责任
         </p>
         <p class="MsoNormal">
         10.1您应理解并按照本协议的约定使用窝边优选提供的产品和服务，履行相应的义务，如您违反本协议的相关约定，窝边优选会视您的实际违约情况选择中止、终止或解除本协议。
         </p>
         <p class="MsoNormal">
         10.2您对软件的使用可能有赖于窝边优选关联公司为您提供的配套服务，如您违反与窝边优选关联公司的条款、协议、规则、通告等相关规定（如有）而被窝边优选关联公司中止或终止提供服务的，可能导致您无法正常使用本许可软件及窝边优选服务，窝边优选会视您的实际违约情况选择中止、终止或解除本协议。
         </p>
         <p class="MsoNormal">
         10.3您理解出于维护交易秩序及保护消费者权益的目的，如果您向窝边优选及/或窝边优选关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺并通知窝边优选依据您与其相关约定进行处理的，则窝边优选可按您的承诺或协议约定的方式对您作出限制，包括中止或终止对您提供窝边优选服务。
         </p>
         <p class="MsoNormal">
         10.4本协议的终止并不影响终止前您与窝边优选基于本协议产生的权利义务。因您的原因导致窝边优选遭受第三方索赔、行政部门处罚等，您应当赔偿窝边优选因此造成的损失及（或）发生的费用，包括合理的律师费用、调查取证费用等。如因您的个人行为造成窝边优选商誉损害的，窝边优选有权要求您在公开媒体上发表声明以消除影响。
         </p>
         <p class="MsoNormal">
         十一、免责条款
         </p>
         <p class="MsoNormal">
         您理解窝边优选将严格按照法律规定以及本协议的约定，为您提供可靠、安全的产品及服务，但发生下列情形之一导致您遭受损失的，窝边优选无法承担责任：
         </p>
         <p class="MsoNormal">
         （1）由于您未妥善管理您的账号信息，或未妥善保管您的登录设备的；
         </p>
         <p class="MsoNormal">
         （2）发生设备维护、信息网络连接故障、智能终端、通讯或其他系统故障等情形的；
         </p>
         <p class="MsoNormal">
         （3）发生地震、海啸、台风、洪水、战争、武斗冲突、罢工、骚乱、暴动、行政机构或司法机构发布命令等不可抗力事件的；
         </p>
         <p class="MsoNormal">
         （4）其他非因窝边优选原因造成的。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         十二、其他
         </p>
         <p class="MsoNormal">
         12.1本协议将对您持续有效,有效期至您注销或者被取消账户、且停止切使用本站服务的行为后,但本站与您之间已经产生的权利义务,仍对双方有约束力。
         </p>
         <p class="MsoNormal">
         12.2窝边优选将视向您所提供服务内容之特性,要求您在注册本站提供的有关服务时,遵守特定的条件和条款，如该特定条件和条款与以上服务条款有任何不一致之处,则以特定条件和条款为准。
         </p>
         <p class="MsoNormal">
         12.3本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力,其余条款仍应有效并且有约束力。
         </p>
         <p class="MsoNormal">
         12.4本协议的标题、序号均为方便阅读而设定,不影响条款实际含义及其效力。本协议内容中以加粗方式显著标识的条款,请您着重阅读。
         </p>
         <p class="MsoNormal">
         12.5本协议自公布及适用的当天生效,有效期持续至更新版本发布之时。
         </p>
         <p class="MsoNormal">
         十三、适用的法律和管辖权
         </p>
         <p class="MsoNormal">
         您和本站之间的契约将适用中华人民共和国的法律,所有的争端将诉诸于窝边优选所在地的人民法院。
         </p>
         <p class="MsoNormal">
         如您对本协议有任何的疑问或建议，可随时致电我们的客服：025-52351126。
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         <p class="MsoNormal">
         <br>
         </p>
         */

        private String title;
        private String content;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }
    }
}
